Revit 2024 API
IFCExtrusionData.IsValid Method
 Determines if the extrusion data represents a valid extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if the extrusion is valid, false otherwise.
See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace